LEMOSinflowGeneratorMod.backup/testCase/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.234;

boundaryField
{
    inner
    {
        type            fixedValue;
        value           uniform 0.223228;
    }
    outer
    {
        type            fixedValue;
        value           uniform 0.223228;
    }
    coflow
    {
        type            fixedValue;
        value           uniform 0.234;
    }
    bluffBody
    {
        type            zeroGradient;
    }
    airBC
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
