LEMOSinflowGeneratorMod.backup/testCase/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

RAS
{
    RASModel        kEpsilon;

    turbulence      on;
    printCoeffs     on;
}

LES
{
    LESModel        Smagorinsky;//dynamicKEqn;

    turbulence      on;

    printCoeffs     on;

    delta           cubeRootVol;//cubeRootVol;//smooth
    
    filter simple;
    Sct 0.7;
}
// ************************************************************************* //
